---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsWarn
source: html/b9d23238-aa5c-b8a3-d055-01ad7ed5be3e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsWarn Property

This is an internal diagnostic message.

## Syntax (C#)
```csharp
public static FailureDefinitionId DebugLevelsInOptionsWarn { get; }
```